<?php


return [
    //红利类型
    'dividend_type' => [
        1 => '充值红利',
        2 => '平台红利',
        3 => '返水',
        4 => '抢红包',
        5 =>'展示活动',
        6 =>'老虎机',
        7 =>'真人娱乐场',
        8 => '注册活动',
        9 => '充值赠送金额',
        10 => '其他'
    ],
    //充值类型
    'recharge_type' => [
        1 => '支付宝',
        2 => '微信',
        3 => '银行转账',
        4 => '第三方支付',
        5 => 'QQ',
    ],
    //充值状态
    'recharge_status' => [
        1 => '待确认',
        2 => '汇款成功',
        3 => '汇款失败'
    ],
    //提款状态
    'drawing_status' => [
        1 => '待确认',
        2 => '提款成功',
        3 => '提款失败'
    ],
    //用户状态
    'member_status' => [
        0 => '启用',
        1 => '禁用'
    ],
    //平台转账类型
    'transfer_type' => [
        0 => '转入游戏',
        1 => '转出游戏'
    ],
    'api_type' => [
        1 => 'AG',
        2 => 'MG',
        3 => 'BBIN'
    ],
    'productType' => [
        1 => 'AG',
        2 => 'MG',
        3 => 'BBIN'
    ],
    'on_line' => [
        0 => '上线',
        1 => '下线'
    ],
    'game_type' => [
        1 => '真人',
        2 => '电子',
        3 => '彩票',
        4 => '体育',
        5 => '电竞',
        6 => '捕鱼',
        7 => '棋牌'
    ],
    'activity_type' => [
        8 => '注册活动',
        9 => '首存活动',
        1 => '返水活动',
        2 => '红利活动',
        3 => '充值活动',
        4 => '展示活动',
        5 => '老虎机',
        6 => '真人娱乐场',
        7 => '其他'
    ],
    'gender' => [
        0 => '男',
        1 => '女'
    ],
    'feedback_type' => [
        1 => '平台问题',
        2 => '财务问题',
        3 => '提供建议'
    ],
    'is_read' => [
        0 => '未读',
        1 => '已读'
    ],
    'productCode' => [
        3=> 'PT',
        12 => 'PNG'
    ],
    'tcg_game_type' => [
        'RNG' => 'RNG',
        'LIVE' => 'LIVE',
        'PVP' => 'PVP',
        'FISH' => 'FISH'
    ],
    'tcg_client_type' => [
        'pc' => 'pc',
        'phone' => 'phone',
        'web' => 'web',
        'html5' => 'html5'
    ],
    'member_on_line' => [
        1 => '在线',
        2 => '下线'
    ],
    'client_type' => [
        1 => 'pc',
        2 => 'phone'
    ],
    'tcg_product_type' => [
        'AG' => 4
    ],
    'about_type' => [
        1 => '关于我们',
        2 => '存款帮助',
        3 => '取款帮助',
        4 => '常见问题',
        5 => '免责声明',
        6 => '代理合作'
    ]
];